sdaiAccessModelBN(Sdai_instS*,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte*,SdaiAccessMode)
\details
Opens a specified model in a specified mode. The model is specified by its repository and name.
\param repository [in] A repository that owns the model. The function searches the model in this repository by the name.
\param modelName  [in] A model name.
\param mode       [in] An open mode.
\returns A pointer to the open model if the function successfully opens the model; otherwise, the function returns the NULL value.